[
  {
    "name": "Adult Bronze Dragon",
    "type": "Huge Dragon (Metallic)",
    "alignment": "Lawful Good",
    "AC": "18",
    "HP": "212 (17d12 + 102)",
    "initiative": "+10 (20)",
    "speed": "40 ft., Fly 80 ft., Swim 40 ft.",
    "abilities": {
      "STR": {
        "total": "25",
        "mod": "+7",
        "save": "+12"
      },
      "DEX": {
        "total": "10",
        "mod": "0",
        "save": "0"
      },
      "CON": {
        "total": "23",
        "mod": "+6",
        "save": "+11"
      },
      "INT": {
        "total": "16",
        "mod": "+3",
        "save": "+3"
      },
      "WIS": {
        "total": "15",
        "mod": "+2",
        "save": "+7"
      },
      "CHA": {
        "total": "24",
        "mod": "+5",
        "save": "+10"
      }
    },
    "skills": "Insight +7, Perception +12, Stealth +5",
    "immunities": "Lightning",
    "senses": "Blindsight 60 ft., Darkvision 120 ft., Passive Perception 22",
    "languages": "Common, Draconic",
    "CR": "15 (XP 13,000, or 15,000 in lair; PB +5)",
    "traits": "<b>Amphibious.</b> The dragon can breathe air and water.<br><b>Legendary Resistance (3/Day, or 4/Day in Lair).</b> If the dragon fails a saving throw, it can choose to succeed instead.",
    "actions": "<b>Multiattack.</b> The dragon makes three Rend attacks. It can replace one attack with a use of (A) Repulsion Breath or (B) Spellcasting to cast <i>Guiding Bolt</i> (level 2 version).<br><b>Rend.</b> Melee Attack Roll: +12, reach 10 ft. Hit: 16 (2d8 + 7) Slashing damage plus 5 (1d10) Lightning damage.<br><b>Lightning Breath (Recharge 5–6).</b> Dexterity Saving Throw: DC 19, each creature in a 90-foot-long, 5-foot-wide Line. <i>Failure:</i> 55 (10d10) Lightning damage. <i>Success:</i> Half damage.<br><br><b>Repulsion Breath.</b> Strength Saving Throw: DC 19, each creature in a 30-foot Cone. <i>Failure:</i> The target is pushed up to 60 feet straight away from the dragon and has the <i>Prone</i> condition.<br><b>Spellcasting.</b> The dragon casts one of the following spells, requiring no material components and using Charisma as the spellcasting ability (spell save DC 17, +10 to hit with spell attacks):<br><b>At Will:</b> <i>Detect Magic, Guiding Bolt</i> (level 2 version), <i>Shapechange</i> (Beast or Humanoid forms only, no Temporary Hit Points gained from the spell, and no Concentration or Temporary Hit Points required to maintain the spell), <i>Speak with Animals, Thaumaturgy</i><br>1/Day Each: <i>Detect Thoughts, Water Breathing</i>",
    "legendary_actions": "<i>Legendary Action Uses: 3 (4 in Lair).</i> <i>Immediately after another creature's turn, the dragon can expend a use to take one of the following actions. The dragon regains all expended uses at the start of each of its turns.</i><br><b>Guiding Light.</b> The dragon uses Spellcasting to cast <i>Guiding Bolt</i> (level 2 version).<br><b>Pounce.</b> The dragon moves up to half its Speed, and it makes one Rend attack.<br><b>Thunderclap.</b> Constitution Saving Throw: DC 17, each creature in a 20-foot-radius Sphere centered on a point the dragon can see within 90 feet. <i>Failure:</i> 10 (3d6) Thunder damage, and the target has the <i>Deafened</i> condition until the end of its next turn."
  }
]