[
  {
    "name": "Horned Devil",
    "type": "Large Fiend (Devil)",
    "alignment": "Lawful Evil",
    "AC": "18",
    "HP": "178",
    "initiative": "+7 (17)",
    "speed": "30 ft., fly 60 ft.",
    "abilities": {
      "STR": {
        "total": "22",
        "mod": "+6",
        "save": "+10"
      },
      "DEX": {
        "total": "17",
        "mod": "+3",
        "save": "+7"
      },
      "CON": {
        "total": "21",
        "mod": "+5",
        "save": "+9"
      },
      "INT": {
        "total": "12",
        "mod": "+1",
        "save": "+1"
      },
      "WIS": {
        "total": "16",
        "mod": "+3",
        "save": "+7"
      },
      "CHA": {
        "total": "18",
        "mod": "+4",
        "save": "+8"
      }
    },
    "skills": "Perception +12",
    "resistances": "Cold",
    "immunities": "Fire, Poison; Poisoned",
    "senses": "Darkvision 150 ft. (unimpeded by magical Darkness); Passive Perception 13",
    "languages": "Infernal; telepathy 120 ft.",
    "CR": "11 (XP 7,200; PB +4)",
    "traits": "<b>Diabolical Restoration.</b> If the devil dies outside the Nine Hells, its body disappears in sulfurous smoke, and it gains a new body instantly, reviving with all its Hit Points somewhere in the Nine Hells.\n<b>Magic Resistance.</b> The devil has advantage on saving throws against spells and other magical effects.",
    "actions": "<b>Multiattack.</b> The devil makes three attacks, using Searing Fork or Hurl Flame in any combination. It can replace one attack with a use of Infernal Tail.\n<b>Searing Fork.</b> Melee Attack: Roll: +10, reach 10 ft. Hit: 15 (2d8 + 6) Piercing damage plus 9 (2d8) Fire damage.\n<b>Hurl Flame.</b> Ranged Attack: Roll: +8, range 150 ft. Hit: 26 (5d8 + 4) Fire damage. If the target is a flammable object that isn't being worn or carried, it starts burning.\n<b>Infernal Tail.</b> Dexterity Saving Throw: DC 17, one creature the devil can see within 10 feet. <i>Failure:</i> 10 (1d8 + 6) Necrotic damage, and the target receives an infernal wound if it doesn't have one. While wounded, the target loses 10 (3d6) Hit Points at the start of each of its turns. The wound closes after 1 minute, after a spell restores Hit Points to the target, or after the target of a creature within 5 feet of it takes an action to stanch the wound, doing so by succeeding on a DC 17 Wisdom (Medicine) check."
  }
]