[
  {
    "name": "Death Knight",
    "type": "Medium or Small Undead",
    "alignment": "Chaotic Evil",
    "AC": "20",
    "HP": "199 (21d8 + 105)",
    "initiative": "+12 (22)",
    "speed": "30 ft.",
    "abilities": {
      "STR": {
        "total": "20",
        "mod": "+5",
        "save": "+5"
      },
      "DEX": {
        "total": "11",
        "mod": "0",
        "save": "+6"
      },
      "CON": {
        "total": "20",
        "mod": "+5",
        "save": "+5"
      },
      "INT": {
        "total": "12",
        "mod": "+1",
        "save": "+1"
      },
      "WIS": {
        "total": "16",
        "mod": "+3",
        "save": "+9"
      },
      "CHA": {
        "total": "18",
        "mod": "+4",
        "save": "+4"
      }
    },
    "skills": "—",
    "resistances": "—",
    "immunities": "Necrotic, Poison; Exhaustion, Frightened, Poisoned",
    "senses": "Darkvision 120 ft.; Passive Perception 13",
    "languages": "Abyssal, Common",
    "CR": "17 (XP 18,000; PB +6)",
    "traits": "<b>Legendary Resistance (3/Day).</b> If the death knight fails a saving throw, it can choose to succeed instead. <br/><b>Magic Resistance.</b> The death knight has Advantage on saving throws against spells and other magical effects.<br/><b>Marshal Undead.</b> Undead creatures of the death knight’s choice (excluding itself) in a 60-foot Emanation originating from it have Advantage on attack rolls and saving throws. It can’t use this trait if it has the Incapacitated condition.<br/><b>Undead Restoration.</b> If the death knight is destroyed before it atones for its evil, it gains a new body in 1d10 days, reviving with all its Hit Points. The new body appears in a location significant to the death knight.",
    "actions": "<b>Multiattack.</b> The death knight makes three Dread Blade attacks.<br/><b>Dread Blade.</b> Melee Attack: +11, reach 5 ft. <i>Hit:</i> 12 (2d6 + 5) Slashing damage plus 13 (3d8) Necrotic damage.",
    "reactions": "<b>Parry.</b> <i>Trigger</i>: The death knight is hit by a melee attack roll while holding a weapon. <i>Response</i>: The death knight adds 6 to its AC against that attack, possibly causing it to miss.",
    "legendary_actions": "<b>Legendary Action Uses: 3.</b> Immediately after another creature's turn, the death knight can expend a use to take one of the following actions. The death knight regains all expended uses at the start of each of its turns.<br/><b>Dread Authority.</b> The death knight uses Spellcasting to cast Command. The death knight can't take this action again until the start of its next turn.<br/><b>Fell Word.</b> <i>Constitution Saving Throw:</i> DC 18, one creature the death knight can see within 120 feet. <i>Failure</i>: 17 (5d6) Necrotic damage, and the target’s Hit Point Maximum decreases by an amount equal to the damage taken. <i>Failure or Success:</i> The death knight can’t take this action again until the start of its next turn.<br/><b>Lunge.</b> The death knight moves up to half its Speed, and it makes one Dread Blade attack."
  }
]