[
  {
    "name": "Erinyes",
    "type": "Medium Fiend (Devil)",
    "alignment": "Lawful Evil",
    "AC": "18",
    "HP": "178 (21d8 + 84)",
    "initiative": "+7 (17)",
    "speed": "30 ft., Fly 60 ft.",
    "abilities": {
      "STR": {
        "total": "18",
        "mod": "+4",
        "save": "+8"
      },
      "DEX": {
        "total": "16",
        "mod": "+3",
        "save": "+7"
      },
      "CON": {
        "total": "18",
        "mod": "+4",
        "save": "+8"
      },
      "INT": {
        "total": "14",
        "mod": "+2",
        "save": ""
      },
      "WIS": {
        "total": "14",
        "mod": "+2",
        "save": "+6"
      },
      "CHA": {
        "total": "18",
        "mod": "+4",
        "save": "+8"
      }
    },
    "skills": "Perception +6, Persuasion +8",
    "resistances": "Cold",
    "immunities": "Fire, Poison; Poisoned",
    "senses": "Truesight 120 ft.; Passive Perception 16",
    "languages": "Infernal; telepathy 120 ft.",
    "CR": "12 (XP 8,400; PB +4)",
    "traits": "<b>Diabolical Restoration.</b> If the erinyes dies outside the Nine Hells, its body disappears in sulfurous smoke, and it gains a new body instantly, reviving with all its Hit Points somewhere in the Nine Hells.<br><b>Magic Resistance.</b> The erinyes has Advantage on saving throws against spells and other magical effects.<br><b>Magic Rope.</b> The erinyes has a magic rope. While bearing it, the erinyes can use the Entangling Rope action. The rope has AC 20, HP 90, and Immunity to Poison and Psychic damage. The rope turns to dust if reduced to 0 Hit Points, if it is 5+ feet away from the erinyes for 1 hour or more, or if the erinyes dies. If the rope is damaged or destroyed, the erinyes can fully restore it when finishing a Short or Long Rest.",
    "actions": "<b>Multiattack.</b> The erinyes makes three Infernal Sword attacks and can use Entangling Rope.<br><b>Withering Sword.</b> Melee Attack Roll: +8, reach 5 ft. Hit: 13 (2d8 + 4) Slashing damage plus 11 (2d10) Necrotic damage.<br><b>Entangling Rope (Requires Magic Rope).</b> Strength Saving Throw: DC 16, one creature the erinyes can see within 120 feet. <i>Failure:</i> 14 (4d6) Force damage, and the target has the Restrained condition until the rope is destroyed, the erinyes uses a Bonus Action to release the target, or the erinyes uses Entangling Rope again.",
    "reactions": "<b>Parry.</b> <i>Trigger:</i> The erinyes is hit by a melee attack roll while holding a weapon. <i>Response:</i> The erinyes adds 4 to its AC against that attack, possibly causing it to miss."
  }
]