[
  {
    "name": "Banshee",
    "type": "Medium Undead",
    "alignment": "Chaotic Evil",
    "AC": "12",
    "HP": "54 (12d8)",
    "initiative": "+2 (12)",
    "speed": "5 ft., Fly 40 ft. (hover)",
    "abilities": {
      "STR": {
        "total": "1",
        "mod": "-5",
        "save": "-5"
      },
      "DEX": {
        "total": "14",
        "mod": "+2",
        "save": "+2"
      },
      "CON": {
        "total": "10",
        "mod": "+0",
        "save": "+0"
      },
      "INT": {
        "total": "12",
        "mod": "+1",
        "save": "+1"
      },
      "WIS": {
        "total": "11",
        "mod": "+0",
        "save": "+0"
      },
      "CHA": {
        "total": "17",
        "mod": "+3",
        "save": "+3"
      }
    },
    "skills": "",
    "resistances": "Acid, Bludgeoning, Fire, Lightning, Piercing, Slashing, Thunder",
    "immunities": "Cold, Necrotic, Poison; Charmed, Exhaustion, Frightened, Grappled, Paralyzed, Petrified, Poisoned, Prone, Restrained",
    "senses": "Darkvision 60 ft.; Passive Perception 10",
    "languages": "Common, Elvish",
    "CR": "4 (XP 1,100; PB +2)",
    "traits": "<b>Detect Life.</b> The banshee magically senses the direction of creatures up to 1 mile away that aren’t Constructs or Undead.<br><br><b>Incorporeal Movement.</b> The banshee can move through other creatures and objects as if they were Difficult Terrain. It takes 5 (1d10) Force damage if it ends its turn inside an object.",
    "actions": "<b>Multiattack.</b> The banshee makes two Corrupting Touch attacks and uses Horrify.<br><br><b>Corrupting Touch.</b> Melee Attack Roll: +5, reach 5 ft. Hit: 7 (1d8 + 3) Necrotic damage.<br><br><b>Horrify.</b> Wisdom Saving Throw: DC 13, one creature the banshee can see within 60 feet that can see the banshee. <i>Failure:</i> The target has the Frightened condition until the start of the banshee’s next turn <i>Success:</i> The target is immune to this banshee’s Horrifying Visage for 24 hours.<br><br><b>Deathly Wail (1/Day).</b> The banshee releases a mournful wail if it isn’t in sunlight. Constitution Saving Throw: DC 13, each creature within 30 feet that can hear the wail and isn’t a Construct or an Undead. <i>Failure:</i> If the target has 25 Hit Points or fewer, it drops to 0 Hit Points. Otherwise, the target takes 10 (3d6) Psychic damage."
  }
]