[
  {
    "name": "Blob of Annihilation",
    "type": "Gargantuan Ooze (Titan)",
    "alignment": "Neutral Evil",
    "AC": "18",
    "HP": "448 (23d20 + 207)",
    "initiative": "+16 (26)",
    "speed": "30 ft.",
    "abilities": {
      "STR": {
        "total": "27",
        "mod": "+8",
        "save": "+9"
      },
      "DEX": {
        "total": "14",
        "mod": "+2",
        "save": "+9"
      },
      "CON": {
        "total": "28",
        "mod": "+9",
        "save": "+16"
      },
      "INT": {
        "total": "10",
        "mod": "+0",
        "save": "+0"
      },
      "WIS": {
        "total": "16",
        "mod": "+3",
        "save": "+3"
      },
      "CHA": {
        "total": "10",
        "mod": "+0",
        "save": "+0"
      }
    },
    "skills": "",
    "resistances": "Bludgeoning, Piercing, Slashing",
    "immunities": "Acid, Necrotic, Poison; Charmed, Exhaustion, Frightened, Grappled, Paralyzed, Petrified, Poisoned, Prone, Restrained, Stunned, Unconscious",
    "senses": "Blindsight 120 ft.; Passive Perception 13",
    "languages": "None",
    "CR": "23 (XP 50,000; PB +7)",
    "traits": "<strong>Astral Implosion.</strong> If the blob is reduced to 0 Hit Points, it implodes and ejects any creatures and objects engulfed by it into the Astral Sea. The blob itself vanishes, leaving behind a layer of slime on everything that was within 60 feet of it. In 1d20 years, the blob reconstitutes on a random world in the Material Plane.<br><br><strong>Legendary Resistance (4/Day).</strong> If the blob fails a saving throw, it can choose to succeed instead.<br><br><strong>Magic Resistance.</strong> The blob has Advantage on saving throws against spells and other magical effects.",
    "actions": "<strong>Multiattack.</strong> The blob makes two Pseudopod attacks and uses Engulf. It can replace one attack with a use of Restraining Glob.<br><br><strong>Pseudopod.</strong> <em>Melee Attack</em> Roll: +15, reach 30 ft. Hit: 24 (3d10 + 8) Force damage.<br><br><strong>Engulf.</strong> The blob moves up to its Speed and can move through the spaces of Huge or smaller creatures and objects. <em>Strength Saving Throw:</em> DC 23, each creature or object whose space the blob enters for the first time during this move. <em>Failure:</em> The target is engulfed. While engulfed, a target has Total Cover against attacks and other effects outside the blob, and when the blob moves, the engulfed target moves with it. A nonmagical object is destroyed after spending 1 minute engulfed.<br>While engulfed, a creature takes 21 (6d6) Force damage at the start of each of its turns, is suffocating, has the Restrained condition, and repeats the save at the end of each of its turns. An engulfed creature that is reduced to 0 Hit Points dissolves into ash, which is ejected into the Astral Sea.<br><em>Success:</em> The target escapes and enters the nearest unoccupied space.",
    "bonus_actions": "<strong>Restraining Glob.</strong> The blob lobs a slimy glob at one Large or smaller creature it can see within 600 feet of itself. <em>Dexterity Saving Throw:</em> DC 23, the targeted creature. <em>Failure:</em> 18 (3d6 + 8) Acid damage. The glob rolls the target 60 feet straight toward the blob, and the target has the Restrained condition until the end of its next turn, when the glob harmlessly dissolves. <em>Success:</em> Half damage only.",
    "legendary_actions": "<strong>Legendary Action Uses:</strong> 3. Immediately after another creature’s turn, the blob can expend use to take one of the following actions. The blob regains all expended uses at the start of each of its turns.<br><br><strong>Decay.</strong> The blob deals 14 (4d6) Necrotic damage to each creature engulfed by it. The blob can’t take this action again until the start of its next turn.<br><br><strong>Grasping Glob.</strong> The blob uses Restraining Glob. The blob can’t take this action again until the start of its next turn.<br><br><strong>Lashing Goop.</strong> The blob makes one Pseudopod attack."
  }
]