[
  {
    "name": "Flesh Golem",
    "type": "Medium Construct",
    "alignment": "Neutral",
    "AC": "9",
    "HP": "127 (15d8 + 60)",
    "initiative": "–1 (9)",
    "speed": "30 ft.",
    "abilities": {
      "STR": {
        "total": "19",
        "mod": "+4",
        "save": "+4"
      },
      "DEX": {
        "total": "9",
        "mod": "–1",
        "save": "–1"
      },
      "CON": {
        "total": "18",
        "mod": "+4",
        "save": "+4"
      },
      "INT": {
        "total": "6",
        "mod": "–2",
        "save": "–2"
      },
      "WIS": {
        "total": "10",
        "mod": "+0",
        "save": "+0"
      },
      "CHA": {
        "total": "5",
        "mod": "–3",
        "save": "–3"
      }
    },
    "immunities": "Lightning, Poison; Charmed, Exhaustion, Frightened, Paralyzed, Petrified, Poisoned",
    "senses": "Darkvision 60 ft.; Passive Perception 10",
    "languages": "Understands Common plus one other language but can't speak",
    "CR": "5 (XP 1,800; PB +3)",
    "traits": "<strong>Aversion to Fire.</strong> If the golem takes Fire damage, it has Disadvantage on attack rolls and ability checks until the end of its next turn.<br><strong>Berserk.</strong> Whenever the golem starts its turn Bloodied, roll 1d6. On a 6, the golem goes berserk. On each of its turns while berserk, the golem attacks the nearest creature it can see. If no creature is near enough to move and attack, the golem attacks an object. Once the golem goes berserk, it remains so until it is destroyed or it is no longer Bloodied.<br>The golem's creator, if within 60 feet of the berserk golem, can try to calm it by taking an action to make a DC 15 Charisma (Persuasion) check; the golem must be able to hear its creator. If this check succeeds, the golem ceases being berserk until the start of its next turn, at which point it resumes rolling for the Berserk trait again if it is still Bloodied.<br><strong>Immutable Form.</strong> The golem can't shape-shift.<br><strong>Lightning Absorption.</strong> Whenever the golem is subjected to Lightning damage, it regains a number of Hit Points equal to the Lightning damage dealt.<br><strong>Magic Resistance.</strong> The golem has Advantage on saving throws against spells and other magical effects.",
    "actions": "<strong>Multiattack.</strong> The golem makes two Slam attacks.<br><strong>Slam.</strong> Melee Attack Roll: +7, reach 5 ft. Hit: 13 (2d8 + 4) Bludgeoning damage plus 4 (1d8) Lightning damage."
  }
]