[
  {
    "name": "Kraken",
    "type": "Gargantuan Monstrosity (Titan)",
    "alignment": "Chaotic Evil",
    "AC": "18",
    "HP": "481 (26d20 + 208)",
    "initiative": "+14 (24)",
    "speed": "30 ft., Swim 120 ft.",
    "abilities": {
      "STR": {
        "total": "30",
        "mod": "+10",
        "save": "+17"
      },
      "DEX": {
        "total": "11",
        "mod": "+0",
        "save": "+7"
      },
      "CON": {
        "total": "26",
        "mod": "+8",
        "save": "+15"
      },
      "INT": {
        "total": "22",
        "mod": "+6",
        "save": "+6"
      },
      "WIS": {
        "total": "18",
        "mod": "+4",
        "save": "+11"
      },
      "CHA": {
        "total": "20",
        "mod": "+5",
        "save": "+5"
      }
    },
    "skills": "History +13, Perception +11",
    "immunities": "Cold, Lightning; Frightened, Grappled, Paralyzed, Restrained",
    "senses": "Truesight 120 ft.; Passive Perception 21",
    "languages": "Understands Abyssal, Celestial, Infernal, and Primordial but can’t speak; telepathy 120 ft.",
    "CR": "23 (XP 50,000, or 62,000 in lair; PB +7)",
    "traits": "Amphibious. The kraken can breathe air and water.<br/><br/>Legendary Resistance (4/Day, or 5/Day in Lair). If the kraken fails a saving throw, it can choose to succeed instead.<br/><br/>Siege Monster. The kraken deals double damage to objects and structures.",
    "actions": "Multiattack. The kraken makes two Tentacle attacks and uses Fling, Lightning Strike, or Swallow.<br/><br/>Tentacle. Melee Attack Roll: +17, reach 30 ft. Hit: 24 (4d6 + 10) Bludgeoning damage. The target has the Grappled condition (escape DC 20) from one of ten tentacles, and it has the Restrained condition until the grapple ends.<br/><br/>Fling. The kraken throws a Large creature Grappled by it to a space it can see within 60 feet of itself that isn’t in the air. Dexterity Saving Throw: DC 25, the creature thrown and each creature in the destination space. Failure: 18 (4d8) Bludgeoning damage, and the target has the Prone condition. Success: Half damage only.<br/><br/>Lightning Strike. Dexterity Saving Throw: DC 23, one creature the kraken can see within 120 feet. Failure: 33 (6d10) lightning damage. Success: Half damage.<br/><br/>Swallow. Dexterity Saving Throw: DC 25, one creature Grappled by the kraken (it can use this to up to four creatures swallowed at a time). Failure: 23 (3d8 + 10) Piercing damage. If the target is Large or smaller, it is swallowed and no longer Grappled. A swallowed creature has the Restrained condition, has Total Cover against attacks and other effects outside the kraken, and takes 24 (7d6) Acid damage at the start of each of its turns. If the kraken takes 50 damage or more on a single turn from a creature inside it, the kraken must succeed on a DC 25 Constitution saving throw at the end of that turn or regurgitate all swallowed creatures, each of which falls in a space within 10 feet of the kraken with the Prone condition. If the kraken dies, any swallowed creature no longer has the Restrained condition and can escape from the corpse using 15 feet of movement, exiting Prone."
  }
]