[
  {
    "name": "Empyrean",
    "type": "Huge Celestial or Fiend (Titan)",
    "alignment": "Neutral",
    "AC": "22",
    "HP": "346 (21d12 + 210)",
    "initiative": "+19 (29)",
    "speed": "50 ft., Fly 50 ft. (hover), Swim 50 ft.",
    "abilities": {
      "STR": {
        "total": "30",
        "mod": "+10",
        "save": "+17"
      },
      "DEX": {
        "total": "21",
        "mod": "+5",
        "save": "+5"
      },
      "CON": {
        "total": "30",
        "mod": "+10",
        "save": "+10"
      },
      "INT": {
        "total": "21",
        "mod": "+5",
        "save": "+5"
      },
      "WIS": {
        "total": "22",
        "mod": "+6",
        "save": "+13"
      },
      "CHA": {
        "total": "27",
        "mod": "+8",
        "save": "+8"
      }
    },
    "skills": "Insight +13, Perception +13",
    "resistances": "Bludgeoning, Piercing, Slashing",
    "immunities": "Necrotic, Radiant",
    "senses": "Truesight 120 ft.; Passive Perception 23",
    "languages": "All",
    "CR": "23 (XP 50,000; PB +7)",
    "traits": "<b>Legendary Resistance (4/Day).</b> If the empyrean fails a saving throw, it can choose to succeed instead.<br><br><b>Magic Resistance.</b> The empyrean has Advantage on saving throws against spells and other magical effects.",
    "actions": "<b>Multiattack.</b> The empyrean makes two attacks, using Sacred Weapon or Divine Ray in any combination.<br><br><b>Sacred Weapon.</b> Melee Attack Roll: +17, reach 10 ft. <i>Hit:</i> 31 (6d6 + 10) Force damage, and the target has the Stunned condition until the start of the empyrean’s next turn. The target can choose not to be Stunned, in which case it takes an extra 21 Force damage that bypasses Resistance or Immunity.<br><br><b>Divine Ray.</b> Ranged Attack Roll: +15, range 600 ft. <i>Hit:</i> 35 (6d8 + 8) Necrotic or Radiant damage (empyrean’s choice).<br><br><b>Spellcasting.</b> The empyrean casts one of the following spells, requiring no Material components and using Charisma as the spellcasting ability (spell save DC 23):<br><i>At Will:</i> <i>Calm Emotions, Greater Restoration, Pass without Trace, Water Breathing<br>1/Day Each:</i> <i>Commune, Dispel Evil and Good, Plane Shift</i>",
    "legendary_actions": "<b>Legendary Action Uses:</b> 3. Immediately after another creature’s turn, the empyrean can expend a use to take one of the following actions. The empyrean regains all expended uses at the start of each of its turns.<br><br><b>Bolster.</b> The empyrean gains 10 Temporary Hit Points, and the empyrean and each ally within 30 feet of it gain Advantage on D20 Tests until the end of the empyrean’s next turn. The empyrean can’t take this action again until the start of its next turn.<br><br><b>Shockwave of Glory.</b> <i>Constitution Saving Throw:</i> DC 23, each creature in a 30-foot Emanation originating from the empyrean. <i>Failure:</i> 27 (6d8) Force damage, and the target has the Prone condition. <i>Success:</i> Half damage only. <i>Failure or Success:</i> The empyrean can’t take this action again until the start of its next turn.<br><br><b>Smite.</b> The empyrean makes one Divine Ray attack."
  }
]