[
  {
    "name": "Couatl",
    "type": "Medium Celestial",
    "alignment": "Lawful Good",
    "AC": "19",
    "HP": "60 (8d8 + 24)",
    "initiative": "+5 (15)",
    "speed": "30 ft., Fly 90 ft.",
    "abilities": {
      "STR": {
        "total": "16",
        "mod": "+3",
        "save": "+3"
      },
      "DEX": {
        "total": "20",
        "mod": "+5",
        "save": "+5"
      },
      "CON": {
        "total": "17",
        "mod": "+3",
        "save": "+5"
      },
      "INT": {
        "total": "18",
        "mod": "+4",
        "save": "+4"
      },
      "WIS": {
        "total": "20",
        "mod": "+5",
        "save": "+7"
      },
      "CHA": {
        "total": "18",
        "mod": "+4",
        "save": "+4"
      }
    },
    "skills": "—",
    "resistances": "Bludgeoning, Piercing, Slashing",
    "immunities": "Psychic, Radiant",
    "senses": "Truesight 120 ft.; Passive Perception 15",
    "languages": "All; telepathy 120 ft.",
    "CR": "4 (XP 1,100; PB +2)",
    "traits": "<b>Shielded Mind.</b> The couatl's thoughts can't be read by any means, and other creatures can communicate with it telepathically only if it allows them.",
    "actions": "<b>Bite.</b> Melee Attack Roll: +7, reach 5 ft. Hit: 11 (1d12 + 5) Piercing damage, and the target has the Poisoned condition until the end of the couatl’s next turn.<br><b>Constrict.</b> Strength Saving Throw: DC 15, one Medium or smaller creature the couatl can see within 5 feet. Failure: 8 (1d6 + 5) Bludgeoning damage. The target has the Grappled condition (escape DC 13), and it has the Restrained condition until the grapple ends.<br><b>Spellcasting.</b> The couatl casts one of the following spells, requiring no spell components and using Wisdom as the spellcasting ability (spell save DC 15):<br><i>At Will:</i> Detect Evil and Good, Detect Magic, Detect Thoughts, Shapechange (Beast or Humanoid form only, no Temporary Hit Points gained from the spell, and no Concentration or Temporary Hit Points required to maintain the spell)<br><i>1/Day Each:</i> Create Food and Water, Dream, Greater Restoration, Scrying, Sleep",
    "bonus_actions": "<b>Divine Aid (2/Day).</b> The couatl casts Bless, Lesser Restoration, or Sanctuary, requiring no spell components and using the same spellcasting ability as Spellcasting."
  }
]